#Косарев ИУ7-11Б

a = float(input('Введите начальное значение аргумента:'))
b = float(input('Введите конечное значение аргумента:'))
p = float(input('Введите значение шага:'))
print ('│————————————————————————————————————————————│')
print ('│   Аргумент                        B        │')
print ('│————————————————————————————————————————————│')
while a < b + p // 2:
    B = a**8 - 5*a**7 + 3*a**6 + 8*a**5 - 35*a**4 + 73*a**3 - 6*a**2 + 23*a + 7
    if B > 10 ** (-5) and B < 10 ** 5:
        print ('│','{:>11.3f}'.format(a),'{:30.3f}'.format(B),'   │', sep = '')
    else:
        print ('│','{:>11.3f}'.format(a),'{:30.3e}'.format(B),'   │', sep = '')
    a = a + p
print ('│————————————————————————————————————————————│')
